<template>
  <div class="wrap">
    <!-- 左侧 -->
    <left>
      <div class="zhen">
        <i class="iconfont icon-zhibeizhen3"></i>
        <div id="map"></div>
      </div>

      <div class="basebtn" @click="down">下载</div>
    </left>
    <!-- 右侧 -->
    <Right>
      <table class="basetable">
        <thead>
          <th>指标名称</th>
          <th>数值</th>
        </thead>
        <tbody>
          <tr v-for="(item,id) in totalName" :key="id">
            <td>{{item.name}}个</td>
            <td>{{item.value}}</td>
          </tr>
        </tbody>
      </table>
      <div class="block">
        <span class="demonstration">空间维度选择:</span>
        <el-cascader
          v-model="value"
          :options="options"
          :props="{ expandTrigger: 'hover' }"
          @change="handleChange"
        ></el-cascader>
      </div>
      <!-- <div id="rightEch"></div> -->
      <div class="basebtn" @click="downTable">下载</div>
    </Right>
    <table style="display:none" id="table1">
      <tr>
        <td>指标名称</td>
        <td>数值</td>
      </tr>
      <tbody>
        <tr v-for="(item,id) in totalName" :key="id">
          <td>{{item.name}}个</td>
          <td>{{item.value}}</td>
        </tr>
      </tbody>
    </table>
  </div>
</template>
<script>
var map = null;
var overlayGroups = null;
import Left from "../base/Left";
import Right from "../base/Right";
import FileSaver from "file-saver";
import XLSX from "xlsx";
export default {
  data() {
    return {
      value: ["浙江", "宁波市"],
      options: [],
      data: [
        {
          name: "",
          num: ""
        }
      ],
      totalNum: "",
      Coverage: "100%",
      center: [121.549792, 29.568388],
      totalimg: require("../../assets/img/码头.png"),
      filterName: [],
      totalName: [
        {
          name: "港口,作业区数量",
          value: ""
        },
        {
          name: "港口,作业区覆盖率",
          value: "89%"
        }
      ] //各个区的总收费站数
    };
  },
  components: {
    Left,
    Right
  },
  computed: {},
  watch: {},
  created() {
    this.options = this.$store.state.options;
    this.$store.commit("setLeftActive", "1-1");
    setTimeout(() => {
      this.$em.$emit("changeTop", "4");
    }, 0);
  },
  mounted() {
    // this.createMap();
    // this.setImg();
    this.setHot();
  },
  methods: {
    handleChange(value) {
      console.log(value);
    },
    createMap() {
      map = new AMap.Map("map", {
        zoom: 10, //级别
        zooms: [5, 15],
        zoomEnable: true,
        doubleClickZoom: true,
        center: this.center, //中心点坐标
        mapStyle: "amap://styles/d13369b65d8f8a5b0efbc515527e1cd9"
      });
    },
    setHot() {
      let lngArr = [
        121.782659,
        121.760013,
        121.706795,
        121.872839,
        121.588029,
        121.555398,
        122.022805,
        121.651069,
        121.981124,
        121.820174,
        121.951479,
        121.60577,
        121.857328,
        121.518069,
        121.730888,
        121.067675,
        121.435809,
        121.718157,
        121.787464,
        121.269857,
        121.514448,
        121.548113,
        121.98406,
        121.935076,
        121.798051,
        121.242985,
        121.191188,
        121.935085,
        122.033339,
        121.15453,
        121.551522,
        121.544191,
        121.844481,
        121.116111,
        121.583112,
        121.595573,
        121.95126,
        121.419615,
        121.882517,
        121.614475,
        121.47792,
        121.612297,
        121.934025,
        121.250231,
        121.519541,
        121.996023,
        121.55543,
        121.959246,
        121.551168,
        121.934576,
        121.997752,
        121.881273,
        121.689542,
        121.713792,
        121.541816,
        121.606131,
        121.947383,
        121.14204,
        121.943899,
        121.935621,
        121.607035,
        121.841354,
        121.826481,
        121.843081,
        121.1459,
        121.993822,
        121.43572,
        121.185419,
        121.466758,
        121.40399,
        121.865642,
        121.77067,
        121.717099,
        122.015287,
        121.947009,
        121.727585,
        121.901816,
        121.998864,
        121.93181,
        121.596347,
        121.96264,
        121.517953,
        121.572001,
        121.713428,
        121.652802,
        121.785343,
        121.83302,
        121.158929,
        121.933218,
        121.613895,
        121.520566,
        121.667845,
        121.553389,
        121.530663,
        121.408295,
        121.350248,
        121.558218,
        122.021359,
        121.563531,
        121.568311,
        121.538708,
        121.650259,
        121.652503,
        121.371229,
        121.955242,
        121.529649,
        121.950241,
        121.06644,
        121.95075,
        121.480893,
        121.471344,
        121.640336
      ];
      let latArr = [
        29.247735,
        29.621219,
        29.944111,
        29.91936,
        29.85545,
        29.845317,
        29.877982,
        29.911665,
        29.884359,
        29.098356,
        29.221273,
        29.90642,
        29.929091,
        29.417616,
        29.955969,
        29.920961,
        29.78235,
        29.943847,
        29.193043,
        30.004911,
        29.574258,
        29.809221,
        29.811064,
        29.917096,
        29.238497,
        30.181137,
        30.167686,
        29.914365,
        29.83115,
        30.311163,
        29.867367,
        29.275846,
        29.92959,
        30.042517,
        29.89514,
        29.930114,
        29.220922,
        29.277971,
        29.453681,
        29.904103,
        29.453178,
        29.903454,
        29.899691,
        30.16213,
        29.525375,
        29.886514,
        30.168673,
        29.493318,
        29.528042,
        29.192627,
        29.886522,
        29.925665,
        29.934307,
        29.942001,
        30.040503,
        30.021204,
        29.20565,
        30.056458,
        29.196889,
        29.896563,
        30.020848,
        29.930721,
        29.937025,
        29.930954,
        30.056868,
        29.766283,
        29.93125,
        30.334238,
        29.910718,
        30.31953,
        29.924919,
        29.2164,
        29.94638,
        29.823944,
        29.202994,
        29.948345,
        29.154409,
        29.887379,
        29.90263,
        29.89919,
        29.883878,
        30.218416,
        29.867951,
        29.942945,
        29.911503,
        29.259032,
        29.89659,
        30.312485,
        29.190881,
        29.904484,
        29.897676,
        29.764968,
        29.271358,
        29.915948,
        29.947705,
        29.22389,
        29.529526,
        29.82293,
        29.895121,
        29.862106,
        29.824487,
        29.842352,
        29.505957,
        29.950701,
        29.225053,
        29.505193,
        29.218235,
        30.038961,
        29.219598,
        29.908807,
        29.512039,
        29.181013
      ];
      //区名
      let name = [
        "英山渡口",
        "敏杰码头",
        "兴发码头",
        "北仑第二港埠分公司通用码头",
        "船靠码头",
        "星奥车联阿里车码头",
        "外峙渡口",
        "宁波甬乐基础渣土中转码头",
        "浙江物产驿烽顺码头",
        "花岙岛码头",
        "石浦码头",
        "水产批发码头",
        "北二司北仑山多用途码头",
        "薛岙码头",
        "东方电缆海缆专用码头",
        "明吴码头",
        "横涨码头",
        "浙江集汇码头",
        "象山台宁",
        "余姚兴财建材码头",
        "龙虾码头",
        "荷塘码头",
        "上阳码头",
        "信业码头",
        "定山塘旧渡口",
        "阳光码头",
        "水果码头",
        "永信码头",
        "郭臣码头",
        "港湾停泊",
        "亚细亚75mall-荷塘码头",
        "梅岙码头",
        "宁波舟山港",
        "七里浦渡头",
        "盐业码头",
        "吃货码头",
        "海防码头",
        "侠客码头",
        "七鲜码头",
        "海通路林码头",
        "加爵科沙场码头",
        "豪城码头",
        "大亨二号泊位码头",
        "柠檬码头",
        "奉化出海码头",
        "白峰轮渡码头",
        "龙山镇码头",
        "石城山码头",
        "桐照码头",
        "象山县石浦水上客运中心",
        "舟山海峡轮渡集团有限公司白峰站",
        "北仑港码头",
        "大件码头",
        "北仑木材码头",
        "九龙湖旅游区-游船码头",
        "郑氏十七房-游船码头",
        "石浦环港游",
        "克拉码头",
        "好望角码头",
        "三大队码头",
        "荥阳望渡口",
        "三期码头",
        "北仑电厂3号码头",
        "宁波港北仑第二集装箱码头",
        "锦福楼真鲜码头",
        "宁波梅山保税港区",
        "半浦古渡口",
        "杭州湾跨海大桥气垫船码头",
        "西洪渡口",
        "云浦码头",
        "二期码头",
        "宁海伍山渡",
        "客货码头",
        "梅东渡口",
        "东门渡口",
        "永大水产码头",
        "鹤浦汽运站",
        "神马渡口",
        "救捞码头",
        "宁波人丰运输有限公司华通码头",
        "华埠码头",
        "海王山码头",
        "石浦又近昌码头",
        "北仑金良码头",
        "宁波生和码头",
        "岳井汽渡",
        "自家码头新矸店",
        "搜索码头",
        "石浦轮渡码头",
        "鑫宏码头",
        "金达利21码头",
        "东钱湖小普陀-游船码头",
        "茶院昌海码头",
        "星乐码头",
        "洪陈村渡口",
        "八卦水系",
        "涌力休闲码头",
        "梅山港",
        "游艇码头",
        "闯码头",
        "联盛月光码头",
        "邱隘镇河道保洁码头",
        "象山海螺水泥码头",
        "城山渡口",
        "象山石浦海岛休闲渔业有限公司",
        "栖凤码头",
        "铜钱碓渡口",
        "夏巷渡",
        "福泰隆水产码头",
        "邵家渡渡口",
        "费家码头",
        "明港码头"
      ];
      this.totalName[0].value = name.length;
      let myChart = this.$echarts.init(document.getElementById("map"));
      var geoCoordMap = {
        英山渡口: [121.782659, 29.247735],
        敏杰码头: [121.760013, 29.621219],
        兴发码头: [121.706795, 29.944111],
        北仑第二港埠分公司通用码头: [121.872839, 29.91936],
        船靠码头: [121.588029, 29.85545],
        星奥车联阿里车码头: [121.555398, 29.845317],
        外峙渡口: [122.022805, 29.877982],
        宁波甬乐基础渣土中转码头: [121.651069, 29.911665],
        浙江物产驿烽顺码头: [121.981124, 29.884359],
        花岙岛码头: [121.820174, 29.098356],
        石浦码头: [121.951479, 29.221273],
        水产批发码头: [121.60577, 29.90642],
        北二司北仑山多用途码头: [121.857328, 29.929091],
        薛岙码头: [121.518069, 29.417616],
        东方电缆海缆专用码头: [121.730888, 29.955969],
        明吴码头: [121.067675, 29.920961],
        横涨码头: [121.435809, 29.78235],
        浙江集汇码头: [121.718157, 29.943847],
        象山台宁: [121.787464, 29.193043],
        余姚兴财建材码头: [121.269857, 30.004911],
        龙虾码头: [121.514448, 29.574258],
        荷塘码头: [121.548113, 29.809221],
        上阳码头: [121.98406, 29.811064],
        信业码头: [121.935076, 29.917096],
        定山塘旧渡口: [121.798051, 29.238497],
        阳光码头: [121.242985, 30.181137],
        水果码头: [121.191188, 30.167686],
        永信码头: [121.935085, 29.914365],
        郭臣码头: [122.033339, 29.83115],
        港湾停泊: [121.15453, 30.311163],
        亚细亚75mall: [121.551522, 29.867367],
        梅岙码头: [121.544191, 29.275846],
        宁波舟山港: [121.844481, 29.92959],
        七里浦渡头: [121.116111, 30.042517],
        盐业码头: [121.583112, 29.89514],
        吃货码头: [121.595573, 29.930114],
        海防码头: [121.95126, 29.220922],
        侠客码头: [121.419615, 29.277971],
        七鲜码头: [121.882517, 29.453681],
        海通路林码头: [121.614475, 29.904103],
        加爵科沙场码头: [121.47792, 29.453178],
        豪城码头: [121.612297, 29.903454],
        大亨二号泊位码头: [121.934025, 29.899691],
        柠檬码头: [121.250231, 30.16213],
        奉化出海码头: [121.519541, 29.525375],
        白峰轮渡码头: [121.996023, 29.886514],
        龙山镇码头: [121.55543, 30.168673],
        石城山码头: [121.959246, 29.493318],
        桐照码头: [121.551168, 29.528042],
        象山县石浦水上客运中心: [121.934576, 29.192627],
        舟山海峡轮渡集团有限公司白峰站: [121.997752, 29.886522],
        北仑港码头: [121.881273, 29.925665],
        大件码头: [121.689542, 29.934307],
        北仑木材码头: [121.713792, 29.942001],
        九龙湖旅游区: [121.541816, 30.040503],
        郑氏十七房: [121.606131, 30.021204],
        石浦环港游: [121.947383, 29.20565],
        克拉码头: [121.14204, 30.056458],
        好望角码头: [121.943899, 29.196889],
        三大队码头: [121.935621, 29.896563],
        荥阳望渡口: [121.607035, 30.020848],
        三期码头: [121.841354, 29.930721],
        北仑电厂3号码头: [121.826481, 29.937025],
        宁波港北仑第二集装箱码头: [121.843081, 29.930954],
        锦福楼真鲜码头: [121.1459, 30.056868],
        宁波梅山保税港区: [121.993822, 29.766283],
        半浦古渡口: [121.43572, 29.93125],
        杭州湾跨海大桥气垫船码头: [121.185419, 30.334238],
        西洪渡口: [121.466758, 29.910718],
        云浦码头: [121.40399, 30.31953],
        二期码头: [121.865642, 29.924919],
        宁海伍山渡: [121.77067, 29.2164],
        客货码头: [121.717099, 29.94638],
        梅东渡口: [122.015287, 29.823944],
        东门渡口: [121.947009, 29.202994],
        永大水产码头: [121.727585, 29.948345],
        鹤浦汽运站: [121.901816, 29.154409],
        神马渡口: [121.998864, 29.887379],
        救捞码头: [121.93181, 29.90263],
        宁波人丰运输有限公司华通码头: [121.596347, 29.89919],
        华埠码头: [121.96264, 29.883878],
        海王山码头: [121.517953, 30.218416],
        石浦又近昌码头: [121.572001, 29.867951],
        北仑金良码头: [121.713428, 29.942945],
        宁波生和码头: [121.652802, 29.911503],
        岳井汽渡: [121.785343, 29.259032],
        自家码头新矸店: [121.83302, 29.89659],
        搜索码头: [121.158929, 30.312485],
        石浦轮渡码头: [121.933218, 29.190881],
        鑫宏码头: [121.613895, 29.904484],
        金达利21码头: [121.520566, 29.897676],
        东钱湖小普陀: [121.667845, 29.764968],
        茶院昌海码头: [121.553389, 29.271358],
        星乐码头: [121.530663, 29.915948],
        洪陈村渡口: [121.408295, 29.947705],
        八卦水系: [121.350248, 29.22389],
        涌力休闲码头: [121.558218, 29.529526],
        梅山港: [122.021359, 29.82293],
        游艇码头: [121.563531, 29.895121],
        闯码头: [121.568311, 29.862106],
        联盛月光码头: [121.538708, 29.824487],
        邱隘镇河道保洁码头: [121.650259, 29.842352],
        象山海螺水泥码头: [121.652503, 29.505957],
        城山渡口: [121.371229, 29.950701],
        象山石浦海岛休闲渔业有限公司: [121.955242, 29.225053],
        栖凤码头: [121.529649, 29.505193],
        铜钱碓渡口: [121.950241, 29.218235],
        夏巷渡: [121.06644, 30.038961],
        福泰隆水产码头: [121.95075, 29.219598],
        邵家渡渡口: [121.480893, 29.908807],
        费家码头: [121.471344, 29.512039],
        明港码头: [121.640336, 29.181013]
      };
      let data = name.map((v, i) => {
        return { name: v, value: 1 };
      });
      var convertData = function(data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
          var geoCoord = geoCoordMap[data[i].name];
          if (geoCoord) {
            res.push(geoCoord.concat(data[i].value));
          }
        }
        return res;
      };
      var option = {
        title: {
          text: "宁波市港口，作业区分布",
          // subtext: "data from PM25.in",
          // sublink: "http://www.pm25.in",
          left: "center",
          textStyle: {
            color: "aqua"
          }
        },
        backgroundColor: "#404a59",
        visualMap: {
          min: 0,
          max: 1,
          splitNumber: 1,
          text: [" 码头，作业区"],
          itemWidth: 50,
          itemHeight: 30,
          align: "left",
          inRange: {
            color: ["red"].reverse()
          },
          textStyle: {
            color: "#fff"
          }
        },
        geo: {
          map: "china",
          zoom: 30,
          center: [121.55027, 29.87386],
          label: {
            emphasis: {
              show: false
            }
          },
          roam: true,
          itemStyle: {
            normal: {
              areaColor: "#323c48",
              borderColor: "#111"
            },
            emphasis: {
              areaColor: "#2a333d"
            }
          }
        },
        series: [
          {
            name: "AQI",
            type: "heatmap",
            coordinateSystem: "geo",
            data: convertData(data)
          }
        ]
      };
      myChart.setOption(option);
    },
    setImg() {
      let lngArr = [
        121.782659,
        121.760013,
        121.706795,
        121.872839,
        121.588029,
        121.555398,
        122.022805,
        121.651069,
        121.981124,
        121.820174,
        121.951479,
        121.60577,
        121.857328,
        121.518069,
        121.730888,
        121.067675,
        121.435809,
        121.718157,
        121.787464,
        121.269857,
        121.514448,
        121.548113,
        121.98406,
        121.935076,
        121.798051,
        121.242985,
        121.191188,
        121.935085,
        122.033339,
        121.15453,
        121.551522,
        121.544191,
        121.844481,
        121.116111,
        121.583112,
        121.595573,
        121.95126,
        121.419615,
        121.882517,
        121.614475,
        121.47792,
        121.612297,
        121.934025,
        121.250231,
        121.519541,
        121.996023,
        121.55543,
        121.959246,
        121.551168,
        121.934576,
        121.997752,
        121.881273,
        121.689542,
        121.713792,
        121.541816,
        121.606131,
        121.947383,
        121.14204,
        121.943899,
        121.935621,
        121.607035,
        121.841354,
        121.826481,
        121.843081,
        121.1459,
        121.993822,
        121.43572,
        121.185419,
        121.466758,
        121.40399,
        121.865642,
        121.77067,
        121.717099,
        122.015287,
        121.947009,
        121.727585,
        121.901816,
        121.998864,
        121.93181,
        121.596347,
        121.96264,
        121.517953,
        121.572001,
        121.713428,
        121.652802,
        121.785343,
        121.83302,
        121.158929,
        121.933218,
        121.613895,
        121.520566,
        121.667845,
        121.553389,
        121.530663,
        121.408295,
        121.350248,
        121.558218,
        122.021359,
        121.563531,
        121.568311,
        121.538708,
        121.650259,
        121.652503,
        121.371229,
        121.955242,
        121.529649,
        121.950241,
        121.06644,
        121.95075,
        121.480893,
        121.471344,
        121.640336
      ];
      let latArr = [
        29.247735,
        29.621219,
        29.944111,
        29.91936,
        29.85545,
        29.845317,
        29.877982,
        29.911665,
        29.884359,
        29.098356,
        29.221273,
        29.90642,
        29.929091,
        29.417616,
        29.955969,
        29.920961,
        29.78235,
        29.943847,
        29.193043,
        30.004911,
        29.574258,
        29.809221,
        29.811064,
        29.917096,
        29.238497,
        30.181137,
        30.167686,
        29.914365,
        29.83115,
        30.311163,
        29.867367,
        29.275846,
        29.92959,
        30.042517,
        29.89514,
        29.930114,
        29.220922,
        29.277971,
        29.453681,
        29.904103,
        29.453178,
        29.903454,
        29.899691,
        30.16213,
        29.525375,
        29.886514,
        30.168673,
        29.493318,
        29.528042,
        29.192627,
        29.886522,
        29.925665,
        29.934307,
        29.942001,
        30.040503,
        30.021204,
        29.20565,
        30.056458,
        29.196889,
        29.896563,
        30.020848,
        29.930721,
        29.937025,
        29.930954,
        30.056868,
        29.766283,
        29.93125,
        30.334238,
        29.910718,
        30.31953,
        29.924919,
        29.2164,
        29.94638,
        29.823944,
        29.202994,
        29.948345,
        29.154409,
        29.887379,
        29.90263,
        29.89919,
        29.883878,
        30.218416,
        29.867951,
        29.942945,
        29.911503,
        29.259032,
        29.89659,
        30.312485,
        29.190881,
        29.904484,
        29.897676,
        29.764968,
        29.271358,
        29.915948,
        29.947705,
        29.22389,
        29.529526,
        29.82293,
        29.895121,
        29.862106,
        29.824487,
        29.842352,
        29.505957,
        29.950701,
        29.225053,
        29.505193,
        29.218235,
        30.038961,
        29.219598,
        29.908807,
        29.512039,
        29.181013
      ];
      //区名
      let name = [
        "英山渡口",
        "敏杰码头",
        "兴发码头",
        "北仑第二港埠分公司通用码头",
        "船靠码头",
        "星奥车联阿里车码头",
        "外峙渡口",
        "宁波甬乐基础渣土中转码头",
        "浙江物产驿烽顺码头",
        "花岙岛码头",
        "石浦码头",
        "水产批发码头",
        "北二司北仑山多用途码头",
        "薛岙码头",
        "东方电缆海缆专用码头",
        "明吴码头",
        "横涨码头",
        "浙江集汇码头",
        "象山台宁",
        "余姚兴财建材码头",
        "龙虾码头",
        "荷塘码头",
        "上阳码头",
        "信业码头",
        "定山塘旧渡口",
        "阳光码头",
        "水果码头",
        "永信码头",
        "郭臣码头",
        "港湾停泊",
        "亚细亚75mall-荷塘码头",
        "梅岙码头",
        "宁波舟山港",
        "七里浦渡头",
        "盐业码头",
        "吃货码头",
        "海防码头",
        "侠客码头",
        "七鲜码头",
        "海通路林码头",
        "加爵科沙场码头",
        "豪城码头",
        "大亨二号泊位码头",
        "柠檬码头",
        "奉化出海码头",
        "白峰轮渡码头",
        "龙山镇码头",
        "石城山码头",
        "桐照码头",
        "象山县石浦水上客运中心",
        "舟山海峡轮渡集团有限公司白峰站",
        "北仑港码头",
        "大件码头",
        "北仑木材码头",
        "九龙湖旅游区-游船码头",
        "郑氏十七房-游船码头",
        "石浦环港游",
        "克拉码头",
        "好望角码头",
        "三大队码头",
        "荥阳望渡口",
        "三期码头",
        "北仑电厂3号码头",
        "宁波港北仑第二集装箱码头",
        "锦福楼真鲜码头",
        "宁波梅山保税港区",
        "半浦古渡口",
        "杭州湾跨海大桥气垫船码头",
        "西洪渡口",
        "云浦码头",
        "二期码头",
        "宁海伍山渡",
        "客货码头",
        "梅东渡口",
        "东门渡口",
        "永大水产码头",
        "鹤浦汽运站",
        "神马渡口",
        "救捞码头",
        "宁波人丰运输有限公司华通码头",
        "华埠码头",
        "海王山码头",
        "石浦又近昌码头",
        "北仑金良码头",
        "宁波生和码头",
        "岳井汽渡",
        "自家码头新矸店",
        "搜索码头",
        "石浦轮渡码头",
        "鑫宏码头",
        "金达利21码头",
        "东钱湖小普陀-游船码头",
        "茶院昌海码头",
        "星乐码头",
        "洪陈村渡口",
        "八卦水系",
        "涌力休闲码头",
        "梅山港",
        "游艇码头",
        "闯码头",
        "联盛月光码头",
        "邱隘镇河道保洁码头",
        "象山海螺水泥码头",
        "城山渡口",
        "象山石浦海岛休闲渔业有限公司",
        "栖凤码头",
        "铜钱碓渡口",
        "夏巷渡",
        "福泰隆水产码头",
        "邵家渡渡口",
        "费家码头",
        "明港码头"
      ];
      this.totalName[0].value = lngArr.length;
      //整合数据
      var totalArr = function() {
        var res = [];
        for (let i = 0; i < name.length; i++) {
          res.push({
            longItude: lngArr[i],
            latItude: latArr[i],
            name: name[i]
          });
        }
        return res;
      };
      let arr = totalArr();
      let size = [50, 50];
      let offset = [-10, -30];
      let img1 = this.totalimg;
      this.base(arr, img1, size, offset, name);
    },
    base(arr, img, size, offset, name) {
      //创建一个icon
      offset = offset || [-13, 20];
      var hosticon = new AMap.Icon({
        size: new AMap.Size(size[0], size[1]),
        image: img,
        imageSize: new AMap.Size(size[0], size[1]),
        bubble: true
      });
      var markers = [];
      for (let i = 0; i < arr.length; i++) {
        var marker = new AMap.Marker({
          position: new AMap.LngLat(arr[i].longItude, arr[i].latItude),
          icon: hosticon,
          offset: new AMap.Pixel(offset[0], offset[1]),
          bubble: true
        });
        markers.push(marker);
        //创建一个div
        let Content = `
            <div class="markerContent1">
                <img class="markerImg1" src="${img}"/>
                <span>${name[i]}</span>
            </div>
        `;
        marker.setContent(Content);
      }
      overlayGroups = new AMap.OverlayGroup(markers);
      map.add(overlayGroups);
      overlayGroups.on("click", function(e) {
        console.log(e);
      });
    },
    //筛选
    show(v) {
      this.hoverName = v;
    },
    rightEch() {
      var myChart = this.$echarts.init(document.getElementById("rightEch"));
      let Xdata = [];
      let Data = [];
      this.top10.forEach(v => {
        Xdata.push(v[1].name);
        Data.push(v[1].value);
      });
      var option = {
        title: {
          text: "排名前十的城市",
          // subtext: "货邮数（吨）",
          left: "center",
          textStyle: {
            color: "aqua"
          }
        },
        grid: {
          bottom: "15%"
        },
        tooltip: {
          trigger: "axis",
          axisPointer: {
            // 坐标轴指示器，坐标轴触发有效
            type: "shadow" // 默认为直线，可选为：'line' | 'shadow'
          }
        },
        legend: {
          data: ["分配比例"],
          textStyle: {
            color: "#fff"
          }
        },
        xAxis: {
          type: "category",
          data: Xdata,
          name: "城市名称",
          axisLabel: {
            show: true,
            textStyle: {
              color: "#fff",
              fontSize: 14
            },
            formatter: function(param) {
              if (param.length > 10) {
                param.slice(0, 10) + "...";
              }
              return param.split("").join("\n");
            }
          },
          //线颜色
          axisLine: {
            lineStyle: {
              color: "#fff",
              type: "solid",
              width: "1"
            }
          }
        },
        yAxis: {
          type: "value",
          name: "货物重量(t)",
          max: 100,
          min: 0,
          axisLabel: {
            show: true,
            textStyle: {
              color: "#fff",
              fontSize: 14
            }
          },
          //线颜色
          axisLine: {
            lineStyle: {
              color: "#fff",
              type: "solid",
              width: "1"
            }
          },
          // 线样式
          splitLine: {
            show: true,
            lineStyle: {
              type: "dashed",
              color: "rgba(255,255,255)",
              width: 1
            }
          }
        },
        series: [
          {
            data: Data,
            type: "bar",
            color: ["rgb(0, 255, 255,.5)"],
            //高亮时的设置
            emphasis: {
              itemStyle: {
                color: "skyblue"
              },
              //文字显示
              label: {
                show: true,
                color: "white"
                // formatter:'123'
              }
            },
            label: {
              show: true,
              formatter: "{c}",
              position: "inside",
              // verticalAlign: "middle",
              textStyle: {
                color: "white",
                fontSize: 20
              }
            }
          }
        ]
      };
      myChart.setOption(option);
    },
    down() {
      const domObj = document.getElementById("map");
      html2canvas(domObj, {
        onrendered: function(canvas) {
          let a = document.createElement("a");
          var body = document.querySelector("body");
          a.href = canvas.toDataURL();
          a.download = "pic.png";
          a.style.display = "none";
          body.append(a);
          a.click();
        }
      });
    },
    downTable() {
      let et = XLSX.utils.table_to_book(document.getElementById("table1")); //此处传入table的DOM节点
      let etout = XLSX.write(et, {
        bookType: "xlsx",
        bookSST: true,
        type: "array"
      });
      try {
        // if (this.value1 == '' && this.value2 == ''){
        //   FileSaver.saveAs(
        //     new Blob([etout], {
        //       type: "application/octet-stream"
        //     }),
        //     'total.xlsx'
        //   ); //trade-publish.xlsx 为导出的文件名
        // } else {
        FileSaver.saveAs(
          new Blob([etout], {
            type: "application/octet-stream"
          }),
          "total.xlsx"
        ); //trade-publish.xlsx 为导出的文件名
        // }
      } catch (e) {
        console.log(e, etout);
      }
      return etout;
    }
  }
};
</script>
<style scoped>
.wrap {
  width: 100%;
  height: 100%;
  position: relative;
  display: flex;
  justify-content: space-around;
  align-items: center;
}

.showname {
  position: absolute;
  bottom: 0;
  width: 80%;
  height: 80px;
  left: 200px;
  display: flex;
  justify-content: space-between;
}
.showname li {
  flex: 1;
  display: flex;
  flex-flow: column;
  align-items: center;
  justify-content: space-around;
  border: 1px solid rgba(50, 92, 92);
  margin: 10px;
  cursor: pointer;
}
.showname li img {
  width: 70%;
}
.showname li span {
  color: white;
  display: block;
  width: 40px;
  text-overflow: ellipsis;
  overflow: hidden;
  white-space: nowrap;
}
#map {
  width: 100%;
  height: 90%;
  border: 1px solid rgb(0, 255, 255, 0.7);
}
.basetable {
  width: 100%;
  border: 1px solid white;
}
.basetable thead th {
  border: 1px solid rgb(0, 255, 255, 0.7);
  color: rgb(0, 255, 255);
  font-size: 24px;
  height: 45px;
}
.basetable tbody td {
  border: 1px solid rgb(0, 255, 255, 0.7);
  color: white;
  height: 30px;
  text-align: center;
  font-size: 16px;
}
.basebtn {
  position: absolute;
  bottom: 20px;
  left: 10px;
}

#rightEch {
  width: 92%;
  height: 40%;
  border: 1px solid rgb(0, 255, 255, 0.7);
  position: absolute !important;
  bottom: 10%;
  margin-left: 5%;
}
</style>